# Implementation of Naive Bayes Algorithm (Gaussian Method)
Gaussian: for continuous or numerical features.

In [1]:
import pandas as pd

In [2]:
#loading the dataset
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [3]:
#drop the useless coloum
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [4]:
#consider the target(dependent) as y and inputs are independent variable
inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [5]:
#categorical value turns to continuous value
dummies = pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [6]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

#### dropping male column as well because of dummy variable trap theory. One column is enough to repressent male vs female

In [7]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs

     Pclass   Age     Fare  female
0         3  22.0   7.2500       0
1         1  38.0  71.2833       1
2         3  26.0   7.9250       1
3         1  35.0  53.1000       1
4         3  35.0   8.0500       0
..      ...   ...      ...     ...
886       2  27.0  13.0000       0
887       1  19.0  30.0000       1
888       3   NaN  23.4500       1
889       1  26.0  30.0000       0
890       3  32.0   7.7500       0

[891 rows x 4 columns]

In [8]:
#Use isna() function to detect missing values(Nan or null).
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [9]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [10]:
#Replacing NaN (or null) Values calculation mean value
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

#### split the dataset

In [11]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [12]:
#Import Gaussian Naive Bayes model
from sklearn.naive_bayes import GaussianNB
#Create a Gaussian Classifier
model = GaussianNB()

In [13]:
#train the model
model.fit(X_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [14]:
#find the accuracy
model.score(X_test,y_test)

0.7574626865671642

In [15]:
X_test[0:10]

     Pclass        Age     Fare  female
284       1  29.699118  26.0000       0
469       3   0.750000  19.2583       1
286       3  30.000000   9.5000       0
833       3  23.000000   7.8542       0
83        1  28.000000  47.1000       0
632       1  32.000000  30.5000       0
29        3  29.699118   7.8958       0
792       3  29.699118  69.5500       1
134       2  25.000000  13.0000       0
202       3  34.000000   6.4958       0

In [16]:
y_test[0:10]

284    0
469    1
286    1
833    0
83     0
632    1
29     0
792    0
134    0
202    0
Name: Survived, dtype: int64

In [17]:
model.predict(X_test[0:10])

array([0, 1, 0, 0, 0, 0, 0, 1, 0, 0], dtype=int64)

In [18]:
#Predict_proba will use the value of probability
model.predict_proba(X_test[:10])

array([[0.75359909, 0.24640091],
       [0.20025192, 0.79974808],
       [0.96201605, 0.03798395],
       [0.95849174, 0.04150826],
       [0.68180972, 0.31819028],
       [0.7486605 , 0.2513395 ],
       [0.9617181 , 0.0382819 ],
       [0.13959037, 0.86040963],
       [0.91596298, 0.08403702],
       [0.96270692, 0.03729308]])